#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.resource_code: Refreshing state... [id=bw9dsvtg]
azuread_user.IT-3: Refreshing state... [id=429dbc0e-ae7f-4389-81d1-5a35e970247d]
azuread_user.AF-5: Refreshing state... [id=0ab12dd1-8877-4647-9cea-18478e655c02]
azuread_user.IT-1: Refreshing state... [id=673121ae-cd46-4bb4-bcb8-8d7c65937e56]
azuread_directory_role.GlobalAdmin: Refreshing state... [id=46131aa8-74dc-45bc-897c-43457932adf3]
azuread_user.IT-2: Refreshing state... [id=ec6c73b7-5715-40a4-bbfe-bbde8304bb17]
azuread_user.AF-4: Refreshing state... [id=fe0ca8af-ab96-421e-bf41-cacdaaa2d6b8]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.RG_CPE: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04OGI4OWY4Yi1mZmM2LTRkN2EtOGQ2ZS0xZTU5MzM4YzY4NDQ7b2JqZWN0SWQ9ZjFiMmEwYzAtNjMyMS00OThmLWI4NTktNjhiNmY4OWYyMzRiO3N1YnNjcmlwdGlvbklkPTc3YmIwYjA3LTU3ZTUtNDRiNS1hMzUwLTMxMGE5MzkxNzI5ODt0ZW5hbnRJZD1jZTQ3NzVkMy0xYzJlLTQ2NDQtYjJiYy02MzFjMTU3ZDJiZTc=]
azurerm_virtual_network.System-network-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1]
azurerm_network_security_group.JumpStationSecurityGroup: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkSecurityGroups/JumpStationSecurityGroup]
azurerm_virtual_network.CondidentialServices-network-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1]
azurerm_public_ip.PublicIP-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/publicIPAddresses/PublicIP-1]
azurerm_storage_account.ConfidentielStorageAccount: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Storage/storageAccounts/confidentielbw9dsvtg]
azurerm_recovery_services_vault.ConfidentialRecoveryVault: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.RecoveryServices/vaults/ConfidentialRecoveryVault]
azuread_group.AF: Refreshing state... [id=a60d58c8-e955-4a2c-9c94-630793006707]
azurerm_subnet.CondidentialServices-network-1-subnet-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1/subnets/CondidentialServices-network-1-subnet-1]
azurerm_virtual_network_peering.ConfidentialServicesToSystem: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/CondidentialServices-network-1/virtualNetworkPeerings/ConfidentialServicesToSystem]
azurerm_subnet.System-network-1-subnet-1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/subnets/System-network-1-subnet-1]
azurerm_virtual_network_peering.SystemToConfidentialServices: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/virtualNetworkPeerings/SystemToConfidentialServices]
azurerm_subnet.System-network-1-subnet-2: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/virtualNetworks/System-network-1/subnets/System-network-1-subnet-2]
azurerm_network_interface.ProductionVM1-NIC: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkInterfaces/ProductionVM1-NIC]
azurerm_network_interface.JumpStationVM1-NIC: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkInterfaces/JumpStationVM1-NIC]
azurerm_virtual_machine.JumpStationVM1: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Compute/virtualMachines/JumpStationVM1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_conditional_access_policy.AdminAccessPolicy will be created
  + resource "azuread_conditional_access_policy" "AdminAccessPolicy" {
      + display_name = "AdminAccessPolicy"
      + id           = (known after apply)
      + state        = "enabled"

      + conditions {
          + client_app_types    = [
              + "all",
            ]
          + sign_in_risk_levels = [
              + "high",
            ]
          + user_risk_levels    = [
              + "high",
            ]

          + applications {
              + excluded_applications = []
              + included_applications = [
                  + "All",
                ]
            }

          + locations {
              + included_locations = [
                  + "All",
                ]
            }

          + platforms {
              + included_platforms = [
                  + "All",
                ]
            }

          + users {
              + included_groups = (known after apply)
            }
        }

      + grant_controls {
          + built_in_controls = [
              + "mfa",
            ]
          + operator          = "OR"
        }
    }

  # azuread_directory_role_assignment.GlobalAdmin will be created
  + resource "azuread_directory_role_assignment" "GlobalAdmin" {
      + app_scope_id              = (known after apply)
      + app_scope_object_id       = (known after apply)
      + directory_scope_id        = (known after apply)
      + directory_scope_object_id = (known after apply)
      + id                        = (known after apply)
      + principal_object_id       = (known after apply)
      + role_id                   = "62e90394-69f5-4237-9190-012177145e10"
    }

  # azuread_group.IT will be created
  + resource "azuread_group" "IT" {
      + assignable_to_role             = true
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "IT"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = [
          + "429dbc0e-ae7f-4389-81d1-5a35e970247d",
          + "673121ae-cd46-4bb4-bcb8-8d7c65937e56",
          + "ec6c73b7-5715-40a4-bbfe-bbde8304bb17",
        ]
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # azurerm_backup_policy_vm.ProductionVM1-backup-policy will be created
  + resource "azurerm_backup_policy_vm" "ProductionVM1-backup-policy" {
      + id                             = (known after apply)
      + instant_restore_retention_days = (known after apply)
      + name                           = "ProductionVM1-backup-policy"
      + policy_type                    = "V1"
      + recovery_vault_name            = "ConfidentialRecoveryVault"
      + resource_group_name            = "CPE-POC"
      + timezone                       = "UTC"

      + backup {
          + frequency = "Daily"
          + time      = "23:00"
        }

      + retention_daily {
          + count = 30
        }
    }

  # azurerm_key_vault.KeyVault1 will be created
  + resource "azurerm_key_vault" "KeyVault1" {
      + access_policy                 = [
          + {
              + key_permissions     = [
                  + "Get",
                ]
              + object_id           = "f1b2a0c0-6321-498f-b859-68b6f89f234b"
              + secret_permissions  = [
                  + "Get",
                ]
              + storage_permissions = [
                  + "Get",
                ]
              + tenant_id           = "ce4775d3-1c2e-4644-b2bc-631c157d2be7"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "francecentral"
      + name                          = "KeyVaultbw9dsvtg"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "CPE-POC"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "ce4775d3-1c2e-4644-b2bc-631c157d2be7"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_access_policy.example will be created
  + resource "azurerm_key_vault_access_policy" "example" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "f1b2a0c0-6321-498f-b859-68b6f89f234b"
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "ce4775d3-1c2e-4644-b2bc-631c157d2be7"
    }

  # azurerm_network_security_rule.JumpStationSecurityRule-1 will be created
  + resource "azurerm_network_security_rule" "JumpStationSecurityRule-1" {
      + access                      = "Allow"
      + destination_address_prefix  = "Internet"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow_traffic_to_internet"
      + network_security_group_name = "JumpStationSecurityGroup"
      + priority                    = 101
      + protocol                    = "*"
      + resource_group_name         = "CPE-POC"
      + source_address_prefix       = "20.43.62.4"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.JumpStationSecurityRule-2 will be created
  + resource "azurerm_network_security_rule" "JumpStationSecurityRule-2" {
      + access                      = "Allow"
      + destination_address_prefix  = "20.43.62.4"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow_only_RDP_traffic_from_CPE_network"
      + network_security_group_name = "JumpStationSecurityGroup"
      + priority                    = 102
      + protocol                    = "*"
      + resource_group_name         = "CPE-POC"
      + source_address_prefix       = "134.214.58.61"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.JumpStationSecurityRule-3 will be created
  + resource "azurerm_network_security_rule" "JumpStationSecurityRule-3" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.0.0.0/16"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow_traffic_to_internal_network"
      + network_security_group_name = "JumpStationSecurityGroup"
      + priority                    = 103
      + protocol                    = "*"
      + resource_group_name         = "CPE-POC"
      + source_address_prefix       = "192.168.0.0/24"
      + source_port_range           = "*"
    }

  # azurerm_storage_share.CondidentialServices-share-1 will be created
  + resource "azurerm_storage_share" "CondidentialServices-share-1" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "confidentiel"
      + quota                = 250
      + resource_manager_id  = (known after apply)
      + storage_account_name = "confidentielbw9dsvtg"
      + url                  = (known after apply)
    }

  # azurerm_virtual_machine.ProductionVM1 will be created
  + resource "azurerm_virtual_machine" "ProductionVM1" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "francecentral"
      + name                             = "ProductionVM1"
      + network_interface_ids            = [
          + "/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC/providers/Microsoft.Network/networkInterfaces/ProductionVM1-NIC",
        ]
      + resource_group_name              = "CPE-POC"
      + tags                             = {
          + "environment" = "System"
        }
      + vm_size                          = "Standard_B2s"

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "osdisk1"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @AxFrancois, Action: `pull_request`, Workflow: `Terraform Plan`*